{"format": "layers-model", "generatedBy": "keras v3.3.3", "convertedBy": "TensorFlow.js Converter v4.19.0", "modelTopology": {"keras_version": "3.3.3", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential_1", "trainable": true, "dtype": "float32", "layers": [{"class_name": "InputLayer", "config": {"batch_shape": [null, 180, 180, 3], "dtype": "float32", "sparse": false, "name": "rescaling_1_input", "input_shape": [180, 180, 3]}}, {"class_name": "Rescaling", "config": {"name": "rescaling_1", "trainable": true, "dtype": "float32", "scale": 0.00392156862745098, "offset": 0.0}}, {"class_name": "Conv2D", "config": {"name": "conv2d_3", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"name": "conv2d_4", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Conv2D", "config": {"name": "conv2d_5", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true, "dtype": "float32", "data_format": "channels_last"}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "dtype": "float32", "rate": 0.2, "seed": null, "noise_shape": null}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 196, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}], "build_input_shape": [null, 180, 180, 3]}}}, "weightsManifest": [{"paths": ["group1-shard1of97.bin", "group1-shard2of97.bin", "group1-shard3of97.bin", "group1-shard4of97.bin", "group1-shard5of97.bin", "group1-shard6of97.bin", "group1-shard7of97.bin", "group1-shard8of97.bin", "group1-shard9of97.bin", "group1-shard10of97.bin", "group1-shard11of97.bin", "group1-shard12of97.bin", "group1-shard13of97.bin", "group1-shard14of97.bin", "group1-shard15of97.bin", "group1-shard16of97.bin", "group1-shard17of97.bin", "group1-shard18of97.bin", "group1-shard19of97.bin", "group1-shard20of97.bin", "group1-shard21of97.bin", "group1-shard22of97.bin", "group1-shard23of97.bin", "group1-shard24of97.bin", "group1-shard25of97.bin", "group1-shard26of97.bin", "group1-shard27of97.bin", "group1-shard28of97.bin", "group1-shard29of97.bin", "group1-shard30of97.bin", "group1-shard31of97.bin", "group1-shard32of97.bin", "group1-shard33of97.bin", "group1-shard34of97.bin", "group1-shard35of97.bin", "group1-shard36of97.bin", "group1-shard37of97.bin", "group1-shard38of97.bin", "group1-shard39of97.bin", "group1-shard40of97.bin", "group1-shard41of97.bin", "group1-shard42of97.bin", "group1-shard43of97.bin", "group1-shard44of97.bin", "group1-shard45of97.bin", "group1-shard46of97.bin", "group1-shard47of97.bin", "group1-shard48of97.bin", "group1-shard49of97.bin", "group1-shard50of97.bin", "group1-shard51of97.bin", "group1-shard52of97.bin", "group1-shard53of97.bin", "group1-shard54of97.bin", "group1-shard55of97.bin", "group1-shard56of97.bin", "group1-shard57of97.bin", "group1-shard58of97.bin", "group1-shard59of97.bin", "group1-shard60of97.bin", "group1-shard61of97.bin", "group1-shard62of97.bin", "group1-shard63of97.bin", "group1-shard64of97.bin", "group1-shard65of97.bin", "group1-shard66of97.bin", "group1-shard67of97.bin", "group1-shard68of97.bin", "group1-shard69of97.bin", "group1-shard70of97.bin", "group1-shard71of97.bin", "group1-shard72of97.bin", "group1-shard73of97.bin", "group1-shard74of97.bin", "group1-shard75of97.bin", "group1-shard76of97.bin", "group1-shard77of97.bin", "group1-shard78of97.bin", "group1-shard79of97.bin", "group1-shard80of97.bin", "group1-shard81of97.bin", "group1-shard82of97.bin", "group1-shard83of97.bin", "group1-shard84of97.bin", "group1-shard85of97.bin", "group1-shard86of97.bin", "group1-shard87of97.bin", "group1-shard88of97.bin", "group1-shard89of97.bin", "group1-shard90of97.bin", "group1-shard91of97.bin", "group1-shard92of97.bin", "group1-shard93of97.bin", "group1-shard94of97.bin", "group1-shard95of97.bin", "group1-shard96of97.bin", "group1-shard97of97.bin"], "weights": [{"name": "sequential_1/conv2d_3/kernel", "shape": [3, 3, 3, 16], "dtype": "float32"}, {"name": "sequential_1/conv2d_3/bias", "shape": [16], "dtype": "float32"}, {"name": "sequential_1/conv2d_4/kernel", "shape": [3, 3, 16, 32], "dtype": "float32"}, {"name": "sequential_1/conv2d_4/bias", "shape": [32], "dtype": "float32"}, {"name": "sequential_1/conv2d_5/kernel", "shape": [3, 3, 32, 64], "dtype": "float32"}, {"name": "sequential_1/conv2d_5/bias", "shape": [64], "dtype": "float32"}, {"name": "sequential_1/dense_1/kernel", "shape": [518400, 196], "dtype": "float32"}, {"name": "sequential_1/dense_1/bias", "shape": [196], "dtype": "float32"}]}]}